Enterprise_Serivces/Prod/Bronze3/LoyaltyPointsService/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/loyaltyprogram/contracts/2010/05/ILoyaltyPointsService/GetAllPointsHistory</wsa:Action><wsa:MessageID>uuid:3ab4ef37-fa72-4e90-82b7-3f06898e8634</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslloyaltyprogramservicesqa1.testgs.pvt/LoyaltyPointsService.svc</wsa:To></soap:Header><soap:Body><GetAllPointsHistory xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><CustomerID xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/messages/2010/11">123456789</CustomerID><NumberOfItemsPerPage xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/messages/2010/11">5</NumberOfItemsPerPage><PageNumber xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/messages/2010/11">1</PageNumber></request></GetAllPointsHistory></soap:Body></soap:Envelope>